<?php

/** @var yii\web\View $this */

$this->title = 'My Yii Application';
?>
<div class="site-index">
    <div class="body-content">
        <div class="text-center h2">Реализация тестового задания "Электронная система приема заказов"</div>
        <div class="row">
            <ul>
                <li>Есть меню, из которого можно составить заказ (можно записать фикстуры заранее и сохранить БД, получение данных только через ActiveRecord)</li>
                <li>авторизация (заказ может сделать авторизованный пользователь)</li>
                <li>добавление новых заказов (пользователь может создавать новые заказы помимо существующих)</li>
                <li>количество единиц заказа (пользователь может указывать количество блюд в заказе)</li>
                <li>личный кабинет пользователя с созданными им заказами</li>
                <li>возможность удаления заказов</li>
            </ul>
        </div>
        <div class="row">
            <div class="text-center h3">Реализовать ТЗ необходимо в среде yii2 basic фреймворка</div>
            <div class="h5">Потребуется реализация кейсов:</div>
            <ul>
                <li>CRUD для ActiveRecord модели yii2, формы</li>
                <li>валидация модели в yii2</li>
                <li>JS скрипты -для динамического добавления/удаления полей в форме (сводобная реализация, можно использовать jquery, vue или другие библиотеки</li>
                <li>Работа с авторизацией/регистрацией в Yii2</li>
                <li>Желательно реализовать кейс регистрации пользователя в самом простом виде</li>
                <li>никакого стилевого оформления не нужно, достаточно базового бутстрапа.</li>
                <li>будем оценивать использование инструментов yii2 для решения задачи, оформление кода и логику</li>
            </ul>
        </div>
    </div>
</div>
